In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### For these exercises you have to use the students table that was created in the notebook 02 and the alumni table created in the notebook 04

In [2]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (5, 'Eve', 18, None),
 (6, 'Mark', 25, 'History')]

In [3]:
%%sql
SELECT * FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(7, 'Grace', 2019, 'Arts'),
 (8, 'Hannah', 2021, 'History'),
 (9, 'Ian', 2020, 'Biology'),
 (10, 'Diana', 2023, 'Biology'),
 (11, 'Alice', 2022, 'Civil Engineering'),
 (12, 'Frank', 2020, 'Social Work')]

### 1. Select all student names together with alumni names if they graduated in the same major. Show both names and the shared major.

In [4]:
%%sql
SELECT s.name AS student_name,
       a.name AS alumni_name,
       s.major
FROM students s
JOIN alumni a
  ON s.major = a.major;

 * postgresql://user:***@localhost:5432/postgres
1 rows affected.

[('Mark', 'Hannah', 'History')]

### 2. List every student and show the graduation year of alumni who studied the same major. If no alumni exists for that major, still include the student.

In [5]:
%%sql
SELECT s.name AS student_name,
       s.major,
       a.graduation_year
FROM students s
LEFT JOIN alumni a 
    ON s.major = a.major;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Mark', 'History', 2021),
 ('Eve', None, None),
 ('Diana', 'Computer Science', None),
 ('Alice', 'Computer Science', None),
 ('Bob', 'Economics', None),
 ('Charlie', 'Chemistry', None)]

### 3. List every alumni and show the names of students who are currently in the same major. If no student exists in that major, still include the alumni.

In [6]:
%%sql
SELECT a.name as alumni_name, 
    s.name as student_name, 
        s.major
FROM students s
RIGHT JOIN alumni a
    ON s.major = a.major;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Grace', None, None),
 ('Hannah', 'Mark', 'History'),
 ('Ian', None, None),
 ('Diana', None, None),
 ('Alice', None, None),
 ('Frank', None, None)]

### 4. Find all majors that currently have students enrolled but no alumni graduated from them. Show the major and the list of student names.

In [16]:
%%sql
-- Anti JOIN
SELECT s.name as student_name,
        s.major as shared_major
FROM students s
LEFT OUTER JOIN alumni a
    ON s.major = a.major
WHERE a.name IS NULL;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[('Eve', None),
 ('Diana', 'Computer Science'),
 ('Alice', 'Computer Science'),
 ('Bob', 'Economics'),
 ('Charlie', 'Chemistry')]

### 5. List all majors that exist either in students or in alumni. Each major should appear only once.

In [9]:
%%sql
-- COALESCE(expr1, expr2, expr3, …) returns the first non-NULL value in the list

SELECT DISTINCT COALESCE(s.major, a.major) AS major
FROM students s
FULL OUTER JOIN alumni a
  ON s.major = a.major;

 * postgresql://user:***@localhost:5432/postgres
9 rows affected.

[(None,),
 ('Arts',),
 ('Computer Science',),
 ('History',),
 ('Economics',),
 ('Social Work',),
 ('Biology',),
 ('Civil Engineering',),
 ('Chemistry',)]

### 6. Find all students that are also alumni and their majors.

In [28]:
%%sql
SELECT s.major as current_major, a.major as finished_major, s.name as student_name
FROM students s 
INNER JOIN alumni a
    ON s.name = a.name;

 * postgresql://user:***@localhost:5432/postgres
2 rows affected.

[('Computer Science', 'Biology', 'Diana'),
 ('Computer Science', 'Civil Engineering', 'Alice')]

### 7. Show all students and all alumni in a single list with their name, type (student/alumni), and major.

In [35]:
%%sql
SELECT COALESCE(a.name, s.name) AS name,
    CASE
        WHEN s.name IS NOT NULL THEN 'student'
        WHEN a.name IS NOT NULL THEN 'alumni'
        END as type,
    COALESCE(a.major, s.major) as major
FROM students s 
FULL OUTER JOIN alumni a
    ON s.student_id = a.alumni_id;

 * postgresql://user:***@localhost:5432/postgres
12 rows affected.

[('Grace', 'alumni', 'Arts'),
 ('Hannah', 'alumni', 'History'),
 ('Ian', 'alumni', 'Biology'),
 ('Diana', 'alumni', 'Biology'),
 ('Alice', 'alumni', 'Civil Engineering'),
 ('Frank', 'alumni', 'Social Work'),
 ('Bob', 'student', 'Economics'),
 ('Eve', 'student', None),
 ('Mark', 'student', 'History'),
 ('Diana', 'student', 'Computer Science'),
 ('Alice', 'student', 'Computer Science'),
 ('Charlie', 'student', 'Chemistry')]

In [ ]:
%%sql
-- option 2
-- 1=0 never pairs rows bc it's always false. Useful if I would have nothing useful to pair
SELECT COALESCE(a.name, s.name) AS name,
    CASE
        WHEN s.name IS NOT NULL THEN 'student'
        WHEN a.name IS NOT NULL THEN 'alumni'
        END as type,
    COALESCE(a.major, s.major) as major
FROM students s 
FULL OUTER JOIN alumni a
    ON 1=0;

 * postgresql://user:***@localhost:5432/postgres
12 rows affected.

[('Grace', 'alumni', 'Arts'),
 ('Hannah', 'alumni', 'History'),
 ('Ian', 'alumni', 'Biology'),
 ('Diana', 'alumni', 'Biology'),
 ('Alice', 'alumni', 'Civil Engineering'),
 ('Frank', 'alumni', 'Social Work'),
 ('Alice', 'student', 'Computer Science'),
 ('Bob', 'student', 'Economics'),
 ('Charlie', 'student', 'Chemistry'),
 ('Diana', 'student', 'Computer Science'),
 ('Eve', 'student', None),
 ('Mark', 'student', 'History')]

### 8. Find students who don’t have a matching alumni in the same major.

In [13]:
%%sql
SELECT s.name, s.major
FROM students s
LEFT JOIN alumni a
    ON s.major = a.major
WHERE a.major IS NULL;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[('Alice', 'Computer Science'),
 ('Bob', 'Economics'),
 ('Charlie', 'Chemistry'),
 ('Diana', 'Computer Science'),
 ('Eve', None)]

### 9. Find alumni whose major is not studied by any current student.

In [14]:
%%sql
SELECT a.name, a.major
FROM students s
RIGHT JOIN alumni a
    ON s.major = a.major
WHERE s.major IS NULL;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[('Grace', 'Arts'),
 ('Ian', 'Biology'),
 ('Diana', 'Biology'),
 ('Alice', 'Civil Engineering'),
 ('Frank', 'Social Work')]

### 10. Create a list of all possible pairs of student names and alumni names, regardless of major.

In [15]:
%%sql
SELECT s.name, a.name
FROM students s
CROSS JOIN alumni a;

 * postgresql://user:***@localhost:5432/postgres
36 rows affected.

[('Alice', 'Grace'),
 ('Bob', 'Grace'),
 ('Charlie', 'Grace'),
 ('Diana', 'Grace'),
 ('Eve', 'Grace'),
 ('Mark', 'Grace'),
 ('Alice', 'Hannah'),
 ('Bob', 'Hannah'),
 ('Charlie', 'Hannah'),
 ('Diana', 'Hannah'),
 ('Eve', 'Hannah'),
 ('Mark', 'Hannah'),
 ('Alice', 'Ian'),
 ('Bob', 'Ian'),
 ('Charlie', 'Ian'),
 ('Diana', 'Ian'),
 ('Eve', 'Ian'),
 ('Mark', 'Ian'),
 ('Alice', 'Diana'),
 ('Bob', 'Diana'),
 ('Charlie', 'Diana'),
 ('Diana', 'Diana'),
 ('Eve', 'Diana'),
 ('Mark', 'Diana'),
 ('Alice', 'Alice'),
 ('Bob', 'Alice'),
 ('Charlie', 'Alice'),
 ('Diana', 'Alice'),
 ('Eve', 'Alice'),
 ('Mark', 'Alice'),
 ('Alice', 'Frank'),
 ('Bob', 'Frank'),
 ('Charlie', 'Frank'),
 ('Diana', 'Frank'),
 ('Eve', 'Frank'),
 ('Mark', 'Frank')]